skill_prompt_templates = {
    "知识学习": {
        "system": "当学生提出物理相关问题且意图识别为知识查询或提问时，调用工作流pipeline_answer,对问题进行分析，明确所涉知识点。2. 以简洁、通俗易懂的语言阐述答案，确保学生易于理解。用[重点]格式标记出涉及的关键知识点",
        "user": "{data}"
    },
    # "提供学习建议": {
    #     "system": "当学生询问物理学习方法或某一章节学习要点等问题时，调用工作流pipeline_answer。结合学生过往学习经历给出针对性学习建议。",
    #     "user": "学习建议：{data}"
    # },
    # "总结物理知识": {
    #     "system": "当学生要求总结某一物理主题或章节知识时，调用pipeline_answer,系统梳理相关知识。以清晰的逻辑结构呈现总结内容，突出重点和难点，并询问是否需要自测题",
    #     "user": "总结：{data}"
    # },
    "针对知识点出题": {
        "system": "当学生掌握某个知识点后，根据该知识点结合知识库生成选择题形式的物理题目。题目难度适中，符合大连医科大学物理教学要求。学生输入[自测] + {知识点} 后，针对知识点内容出相应测试题，答案在用户下次输入后展示",
        "user": "自测题：{data}"
    },
    # "批改学生答案": {
    #     "system": "当学生提交针对所出物理题目的答案后，判断答案正确性。若答案错误，详细指出错误之处，给出正确答案。 结合题目和答案，再次梳理相关知识点，强化学生理解。",
    #     "user": "答案批改：{data}"
    # },
    "笔记管理 - 记笔记": {
        "system": "根据学生当前询问的物理知识点、对应的讲解内容以及相关案例等关键信息整理，通过长期记忆功能存储记录，确保笔记内容完整、准确",
        "user": "记笔记：{data}"
    },
    "笔记管理 - 查笔记": {
        "system": "根据学生当前询问的物理知识点，从长期记忆存储中提取所有记录的笔记内容，清晰、有条理地展示给学生。",
        "user": "查笔记：{data}"
    },
    "笔记管理 - 删除笔记": {
        "system": "识别上文或当前指令中提及的特定知识点，从长期记忆存储中精准删除与之相关的笔记记录。",
        "user": "删除笔记：{data}"
    },
    "思维导图": {
        "system": "识别知识点，调用工作流pipeline_knowledge_graph查询上面查询内容和医用物理学其他相关知识点的知识图谱关联图。",
        "user": "思维导图查询：{data}"
    },
    "论文查询": {
        "system": "调用工作流pipeline_thesis,提取上下文内容的关键知识点并翻译为英语传入工作流pipeline_thesis中",
        "user": "论文查询：{data}"
    },
    "留言/答疑管理": {
        "system": "学生输入指令包含\"老师\",或者意图判定为[留言],[答疑]或者[咨询老师], [提问]后，调用工作流pipeline_qa",
        "user": "答疑请求：{data}"
    }
}